Tekla Open API Reference for Tekla Structures 2025
GridLine.GridLabel.GridLabelText Property
 The grid line's label text.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string GridLabelText { get; }
Public ReadOnly Property GridLabelText As String
	Get
Property Value
Type: String
See Also
Reference
GridLine.GridLabel Class
Tekla.Structures.Drawing Namespace